sunnike/SVA-1000/STM32F091RCTx_freeRTOS/Src/freertos.c
uint8_t uart_findDataIndex(uint8_t uart_msg[], uint8_t target_data)
{
	// target data is the target_comma
	// first data is regard as 0th comma

	uint8_t index, split_count;
	// find index
	split_count = 0;
	for(index = 0; index<UART2_RX_LENGTH; index++)
	{
		if(target_data == 1)
		{
			if(uart_msg[index] == ':')
			{
				return (index+2);
			}
		}
		else
		{
			if(uart_msg[index] == ',')
			{
				split_count++;
			}

			if(split_count == target_data)
			{
				return (index+1);
			}
		}
	}
}

uint8_t uart2_isFindString(uint8_t uart_msg[], uint8_t target_string[], uint8_t length)
{
	uint8_t index, string_index, flag_find = 0;
	for(index = 0; index<UART2_RX_LENGTH; index++)
	{
		if(uart_msg[index] == target_string[0])
		{
			for(string_index = 1; string_index < length; string_index++)
			{
				if(uart_msg[index + string_index] != target_string[string_index])
				{
					flag_find = 0;
					break;
				}
				else
				{
					flag_find = 1;
				}
			}
			break;
		}
	}
	return flag_find;
}

void enable_4GModule(void)
{
	HAL_GPIO_WritePin(GPIOC, TEST_4G_Pin, GPIO_PIN_RESET);
	HAL_Delay(50);
	HAL_GPIO_WritePin(GPIOC, TEST_4G_Pin, GPIO_PIN_SET);
}

void print_atCommand(uint8_t rx_msg[], uint8_t onOff)
{
	int i;
	if(onOff == 1)
	{
		aewin_dbg("=====AT command=====\r\n");
		for(i=0;i<UART2_RX_LENGTH;i++)
		{
			aewin_dbg("%c",rx_msg[i]);
		}
		aewin_dbg("---------------------\r\n");
	}
}

uint8_t check_lowPower(uint32_t adc_value)
{
	uint8_t low_std = 9*10 + current_IgEvent[NUM_12V_shutdown]*5;

	if( (adc_voltageConversion_int(adc_value)*10 + (adc_voltageConversion_float(adc_value)/10) ) < low_std)
	{
		return 1;
	}
	else
	{
		return 0;
	}


	//current_IgEvent[NUM_12V_startup];
	//current_IgEvent[NUM_12V_shutdown];
	//current_IgEvent[NUM_24V_startup];
	//current_IgEvent[NUM_24V_shutdown];
}
/* USER CODE END Application */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
